function [ dn,d ] = synthetic_data()
% 2025/02 中国矿业大学（北京），六道口矿工
%% 生成合成数据
a1=zeros(300,60);  % 此时a1是维度为300*20的全零矩阵
[n,m]=size(a1);    % n=300, m=20
a2=a1;             % 此时a2是维度为300*20的全零矩阵
a5=a1;
% 本次循环结束后生成1*56的行向量b1
% 对主频率值为30Hz的雷克子波进行采样
% 采样区间是-0.055:0.055，采样间隔为0.002。
b1=zeros(1,56);
%b2=zeros(1,56);
temp=0;  
for t=-0.055:0.002:0.055  % 总共循环56次
    temp=temp+1;                % temp从0到56
    b1(temp)=(1-2*(pi*40*t).^2).*exp(-(pi*40*t).^2);
   % b2(temp)=(1-2*(pi*40*t).^2).*exp(-(pi*40*t).^2);
end
% 本循环结束后temp=56
t1=zeros(1,m); t2=zeros(1,m); t5=zeros(1,m);
for i=1:m  % 1到20循环20次
% round()四舍五入
    t1(i)=round(140);      % 最终生成1*20的行向量t1
% [140,140,140,140,140,140,140,140,140,140,140,140,140,140,140,140,140,140,140,140]
    t2(i)=round(-3*i+190); % 最终生成1*20的行向量t2
    t5(i)=round(-2*i+230);  %
% [174,168,162,156,150,144,138,132,126,120,114,108,102,96,90,84,78,72,66,60]
    a1(t1(i):t1(i)+temp-1,i)=b1; % 第i次循环就将列向量b1赋给a1的第i列的第t1(i)到t1(i)+temp-1项
    a2(t2(i):t2(i)+temp-1,i)=b1; % 第i次循环就将列向量b1赋给a2的第i列的第t2(i)到t2(i)+temp-1项
    a5(t5(i):t5(i)+temp-1,i)=b1;
end

a3=zeros(300,60);            % 此时a3是维度为300*20的全零矩阵
a4=a1;
t3=zeros(1,m);
t4=zeros(1,m);
data_3D=zeros(300,60,60);    % 此时data_3D是维度为300*20*20的全零张量
for j=1:60                   % 1到20循环20次
    for k=1:m
        t3(k)=round(3*k+15+2*j);
        a3(t3(k):t3(k)+temp-1,k)=b1;  % 此时temp=56
        t4(k)=round(140-2*j);
        a4(t4(k):t4(k)+temp-1,k)=b1;  % 此时temp=56
    end
    data_3D(:,:,j)=a2(1:300,:)+a3(1:300,:)+a4(1:300,:)+a5(1:300,:);
end
% a2斜向上方向有元素，a3是斜向下方向有元素，a4水平方向有元素
% a3(j)第一列和最后一列有元素的范围分别为分别为174--229,60--115
% a3(j)第一列和最后一列有元素的范围分别为分别为19--74+（j-1)*3,133--188+（j-1)*3
% a4(j)第一列和最后一列有元素的范围分别为分别为138+（j-1)*2--195,138+（j-1)*2--195
%大循环j结束后shot是一个300*20*20的张量
max_data_3D=max(max(max(data_3D)));  % 三维张量data_3D中最大的值
d=data_3D/max_data_3D;               % 三维张量data_3D归一化处理

%% 加入噪声
% randn产生均值为0，方差 σ^2 = 1，标准差σ = 1的正态分布的随机数或矩阵的函数。
randn('state',201314);    % 设置随机种子state=201314
var=0.1;                  % var控制噪声的抖动幅值
dn=d+var*randn(size(d));  % randn(size(d))生成和d一样维度的随机张量

